Revit 2027 API
FabricationPart.ProductDataRange Property
 The product data range of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductDataRange { get; }
Public ReadOnly Property ProductDataRange As String
	Get
public:
property String^ ProductDataRange {
	String^ get ();
}
member ProductDataRange : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace